In [57]:
import pandas as pd
col1=["이름", "국어", "영어"]
df1 = pd.DataFrame([['송중기', 77, 80], ['김나현', 92, 72], ['권보아', 62, 88], 
                    ['박효신', 91, 95]], columns=col1)
df2 = df1.copy()
df3 = df1.copy()
df4 = df1.copy()
df5 = df1.copy()

# 1. 간단한 불리언 마스킹

In [20]:
df1.loc[df1["국어"]> 90, "국어"] = "A"
df1

    이름  국어  영어
0  송중기  77  80
1  김나현   A  72
2  권보아  62  88
3  박효신   A  95

# 2. 복잡한 불리언 마스킹

In [24]:
df2["국어"] = df2["국어"].mask(df2["국어"]>90, "A")
df2

    이름  국어  영어
0  송중기  77  80
1  김나현   A  72
2  권보아  62  88
3  박효신   A  95

In [38]:
df3["국어최종"] = df3["국어"].mask(df2["영어"]>80, "면제")
df3

    이름  국어  영어 국어최종
0  송중기  77  80   77
1  김나현  92  72   92
2  권보아  62  88   면제
3  박효신  91  95   면제

In [60]:
cond1 = df4["국어"] > 90
cond2 = df4["영어"] > 90
df4["국어"] = df4["국어"].mask(cond1 & cond2, "우수")
df4

    이름  국어  영어
0  송중기  77  80
1  김나현  92  72
2  권보아  62  88
3  박효신  우수  95

# 3. 연속 불리언마스킹

In [59]:
cond3 = df4["국어"] > 90

df5["국어"] = df5["국어"].mask(cond3, "A").mask(~cond3, "B")
df5

    이름 국어  영어
0  송중기  B  80
1  김나현  A  72
2  권보아  B  88
3  박효신  A  95